In [1]:
import pandas as pd

In [2]:
# -------------------------------------------------------------------------------------------------
# 1. read csv files
# -------------------------------------------------------------------------------------------------
df_charac_2019 = pd.read_csv('../data/gov_charac_2019.csv', sep=';',encoding='latin1')
df_charac_2020 = pd.read_csv('../data/gov_charac_2020.csv', sep=';',encoding='latin1')
df_charac_2021 = pd.read_csv('../data/gov_charac_2021.csv', sep=';',encoding='latin1')
df_charac_2022 = pd.read_csv('../data/gov_charac_2022.csv', sep=';',encoding='latin1')
df_charac_2023 = pd.read_csv('../data/gov_charac_2023.csv', sep=';',encoding='latin1')
df_charac_2024 = pd.read_csv('../data/gov_charac_2024.csv', sep=';',encoding='latin1')

In [6]:
print('2019:', df_charac_2019.shape)
print('2020:', df_charac_2020.shape)
print('2021:', df_charac_2021.shape)
print('2022:', df_charac_2022.shape)
print('2023:', df_charac_2023.shape)
print('2024:', df_charac_2024.shape)

display(df_charac_2019.head(3))
display(df_charac_2020.head(3))
display(df_charac_2021.head(3))
display(df_charac_2022.head(3))
display(df_charac_2023.head(3))
display(df_charac_2024.head(3))

2019: (58840, 15)
2020: (47744, 15)
2021: (56518, 15)
2022: (55302, 15)
2023: (54822, 15)
2024: (54402, 15)

,Num_Acc,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
0,201900000001,30,11,2019,01:30,4,93,93053,1,1,1,2,AUTOROUTE A3,"48,8962100","2,4701200"
1,201900000002,30,11,2019,02:50,3,93,93066,1,1,1,6,AUTOROUTE A1,"48,9307000","2,3688000"
2,201900000003,28,11,2019,15:15,1,92,92036,1,1,1,4,AUTOROUTE A86,"48,9358718","2,3191744"

,Num_Acc,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
0,202000000001,7,3,2020,16:55,1,91,91657,2,3,1,3,HENRI BARBUSSE (AVENUE),"48,7053500","2,4384100"
1,202000000002,7,3,2020,08:35,2,91,91657,2,9,7,6,MOUSSEAUX(CHEMIN),"48,6900000","2,4100000"
2,202000000003,7,3,2020,13:30,1,91,91174,2,2,1,3,CARNOT(AVENUE),"48,6106700","2,4758200"

,Num_Acc,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
0,202100000001,30,11,2021,07:32,2,30,30319,1,1,1,1,CD 981,"44,0389580000","4,3480220000"
1,202100000002,25,9,2021,14:20,1,51,51544,1,3,1,3,Aire de repos croisement D20E9 aprÃ¨s sortie D977,"49,2421290000","4,5545460000"
2,202100000003,15,7,2021,07:55,1,85,85048,2,1,7,6,15 rue FranÃ§ois Nicolas,"46,9219500000","-0,9644600000"

,Num_Acc,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
0,202200000001,19,10,2022,16:15,1,26,26198,2,3,1,3,TEIL(vieille route du),"44,5594200000","4,7257200000"
1,202200000002,20,10,2022,08:34,1,25,25204,2,3,1,3,Miranda,"46,9258100000","6,3462000000"
2,202200000003,20,10,2022,17:15,1,22,22360,2,6,1,2,ROND POINT DE BREZILLET,"48,4931620000","-2,7604390000"

,Num_Acc,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
0,202300000001,7,5,2023,06:00,1,75,75101,2,4,2,7,RUE DE RIVOLI,"48,86638600","2,32347100"
1,202300000002,7,5,2023,05:30,5,94,94080,2,1,3,6,Avenue de Paris,"48,84547782","2,42868146"
2,202300000003,7,5,2023,20:50,1,94,94022,2,3,2,1,Avenue du GÃ©nÃ©ral Leclerc,"48,76240000","2,40655000"

,Num_Acc,jour,mois,an,hrmn,lum,dep,com,agg,int,atm,col,adr,lat,long
0,202400000001,25,3,2024,07:40,2,70,70285,1,1,5,1,D438,"47,56277000","6,75832000"
1,202400000002,20,3,2024,15:05,1,21,21054,2,3,7,6,HOTEL DIEU (RUE DE L'),"47,02109000","4,83755000"
2,202400000003,22,3,2024,19:30,2,15,15012,1,1,1,6,AllÃ©e des Tilleuls,"44,90238400","2,49641800"

In [5]:
# -------------------------------------------------------------------------------------------------
# 2. rename differing column names
# -------------------------------------------------------------------------------------------------
df_charac_2022 = df_charac_2022.rename(columns={'Accident_Id': 'Num_Acc'})

In [8]:
# -------------------------------------------------------------------------------------------------
# 3. check dtypes over the year
# -------------------------------------------------------------------------------------------------
# List of years and corresponding DataFrames
years = list(range(2019, 2024))
dfs = {year: globals()[f'df_charac_{year}'] for year in years}

# Collect column-dtype pairs per year
records = []
for year, df in dfs.items():
    for col in df.columns:
        records.append({'Year': year, 'Column': col, 'Dtype': df[col].dtype.name})

# Create DataFrame from records
df_summary = pd.DataFrame(records)

# Crosstab: Column vs. Year, showing dtype
crosstab = pd.crosstab(df_summary['Column'], df_summary['Year'], values=df_summary['Dtype'], aggfunc='first')

crosstab

Year       2019    2020    2021    2022    2023
Column
Num_Acc   int64   int64   int64   int64   int64
adr      object  object  object  object  object
agg       int64   int64   int64   int64   int64
an        int64   int64   int64   int64   int64
atm       int64   int64   int64   int64   int64
col       int64   int64   int64   int64   int64
com      object  object  object  object  object
dep      object  object  object  object  object
hrmn     object  object  object  object  object
int       int64   int64   int64   int64   int64
jour      int64   int64   int64   int64   int64
lat      object  object  object  object  object
long     object  object  object  object  object
lum       int64   int64   int64   int64   int64
mois      int64   int64   int64   int64   int64

In [9]:
# -------------------------------------------------------------------------------------------------
# 4. Concat yearly files to one df
# -------------------------------------------------------------------------------------------------
df_charac_2019_2024 = pd.concat([df_charac_2019, df_charac_2020, df_charac_2021, df_charac_2022, df_charac_2023, df_charac_2024], axis=0)

print(df_charac_2019_2024.shape)
print(df_charac_2019_2024.info())

(327628, 15)
<class 'pandas.core.frame.DataFrame'>
Index: 327628 entries, 0 to 54401
Data columns (total 15 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   Num_Acc  327628 non-null  int64
 1   jour     327628 non-null  int64
 2   mois     327628 non-null  int64
 3   an       327628 non-null  int64
 4   hrmn     327628 non-null  object
 5   lum      327628 non-null  int64
 6   dep      327628 non-null  object
 7   com      327628 non-null  object
 8   agg      327628 non-null  int64
 9   int      327628 non-null  int64
 10  atm      327628 non-null  int64
 11  col      327628 non-null  int64
 12  adr      321339 non-null  object
 13  lat      327628 non-null  object
 14  long     327628 non-null  object
dtypes: int64(9), object(6)
memory usage: 40.0+ MB
None

In [10]:
# -------------------------------------------------------------------------------------------------
# 5. export final dataframe to joblib
# -------------------------------------------------------------------------------------------------
from joblib import dump

dump(df_charac_2019_2024, '1.0-leibold-data-exploration_accidents.joblib')

['1.0-leibold-data-exploration_accidents.joblib']